cats_99/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birthdate", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["birthdate", "2020-02-02"], ["color", "black"], ["name", "Donna"], ["sex", "F"], ["description", "Hi!"], ["created_at", "2021-11-13 17:27:09.432721"], ["updated_at", "2021-11-13 17:27:09.432721"]]
---
    def create
        @cat = Cat.new(cat_params)
        if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 1]]
---
    def destroy
        @cat = Cat.find(params[:id])
        @cat.destroy